Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Some people have to do work on MS-Windows systems one day and on Unix another day.
es_es: Hay gente que tiene que trabajar un día con sistemas MS-WINDOWS y con Unix al siguiente.

source: If you are one of them, consider adding "slash" and "unix" to 'sessionoptions'.
es_es: Si es uno de ellos, considere añadir «slash» y «unix» a 'sessionoptions'.

source: The session files will then be written in a format that can be used on both systems.
es_es: Los archivos de sesión se guardarán en un formato que les permita ser usados en ambos sistemas.

source: This is the command to put in your vimrc file: >
es_es: Esta es una orden para poner en su archivo vimrc: >

source: Vim will use the Unix format then, because the MS-Windows Vim can read and write Unix files, but Unix Vim can't read MS-Windows format session files.
es_es: Vim usará el formato Unix, porque Vim para MS-Windows puede leer y escribir archivos de Unix, pero Vim para Unix no puede leer los archivos de sesión con formato de MS-Windows.

source: Similarly, MS-Windows Vim understands file names with / to separate names, but Unix Vim doesn't understand \.
es_es: De manera similar, Vim para MS-Windows entiene los nombres de archivo con «/» como diferentes palabras, pero Vim para Unix no entiende «\».

source: Sessions store many things, but not the position of marks, contents of registers and the command line history.
es_es: Las sesiones guardan muchas cosas, pero no la posición de las marcas, contenidos de registros e historiales de la línea de órdenes.

source: You need to use the viminfo feature for these things.
es_es: Precisa emplear «viminfo» para estas cosas.

source: In most situations you will want to use sessions separately from viminfo.
es_es: En la mayoría de las situaciones deseará usar sesiones separadas de «viminfo».

source: This can be used to switch to another session, but keep the command line history.
es_es: Puede emplear esto para pasar a otra sesión, pero manteniendo el historial de la línea de órdenes.

source: And yank text into registers in one session, and paste it back in another session.
es_es: También puede copiar el texto de los registros de una sesión, y pegarlos en otra sesión diferente.

source: You might prefer to keep the info with the session.
es_es: Puede que prefiera mantener el información en la sesión.

source: You will have to do this yourself then.
es_es: Tendrá que hacer esto usted mismo.

source: ~/.vim/secret.vim :wviminfo!
es_es: ~/.vim/secreto.vim :wviminfo!

source: :source ~/.vim/secret.vim :rviminfo!
es_es: :source ~/.vim/secreto.vim :rviminfo!

source: A session stores the looks of the whole of Vim.
es_es: Una sesión guarda el aspecto completo de Vim.

source: When you want to store the properties for one window only, use a view.
es_es: Cuando desea guardar sólo las propiedades de una ventana, use una vista.

source: The use of a view is for when you want to edit a file in a specific way.
es_es: El uso de una vista es útil cuando desea editar un archivo de una manera específica.

source: For example, you have line numbers enabled with the 'number' option and defined a few folds.
es_es: Por ejemplo, ha activado el número de líneas con la opción 'number' y definido algunos plegados.

source: Just like with sessions, you can remember this view on the file and restore it later.
es_es: Al igual que con las sesiones, puede guardar esta vista en el archivo y restaurarla más tarde.

source: Actually, when you store a session, it stores the view of each window.
es_es: En realidad, cuando guarda una sesión, éste guarda la vista de cada ventana.

source: There are two basic ways to use views.
es_es: Hay dos maneras básicas de usar las vistas.

source: The first is to let Vim pick a name for the view file.
es_es: La primera es dejar que Vim escoja el nombre para el archivo de la vista.

source: You can restore the view when you later edit the same file.
es_es: Puede restaurar la vista posteriormente cuando edite el mismo archivo.

source: To store the view for the current window: >
es_es: Para guardar la vista de la ventana actual: >

source: Vim will decide where to store the view.
es_es: Vim decidirá donde guardar la vista.

source: When you later edit the same file you get the view back with this command: >
es_es: Cuando más tarde edite el mismo archivo puede recuperar la vista con esta orden: >

source: That's easy, isn't it?
es_es: Fácil, ¿no?

source: Now you want to view the file without the 'number' option on, or with all folds open, you can set the options to make the window look that way.
es_es: Cuando quiere ver el archivo sin la opción 'number' activada, o con todos los plegados abiertos, puede definir las opciones para que la ventana presente ese aspecto.

source: Then store this view with: >
es_es: Una vez hecho ésto, guarde ésta vista con: >

source: Now you can switch between the two views on the file by using ":loadview" with and without the "1" argument.
es_es: Ahora puede pasar de una vista a otra del archivo usando «:loadview» con y sin el argumento «1».

source: You can store up to ten views for the same file this way, one unnumbered and nine numbered 1 to 9.
es_es: De esta forma, puede guardar hasta diez vistas para el mismo archivo, uno sin numerar y nueve numerados del 1 al 9.

source: The second basic way to use views is by storing the view in a file with a name you chose.
es_es: La segunda manera básica de usar las vistas se puede hacer guardando la vista en un archivo con un nombre de su elección.

source: This view can be loaded while editing another file.
es_es: Puede cargar esta vista mientras edita un archivo distinto.

source: Vim will then switch to editing the file specified in the view.
es_es: Entonces, Vim pasará a editar el archivo especificado en la vista.

source: Thus you can use this to quickly switch to editing another file, with all its options set as you saved them.
es_es: Por ello, puede usar ésto para pasar rápidamente a editar otro archivo, con todas las opciones definidas tal y como las guardó.

source: For example, to save the view of the current file: >
es_es: Por ejemplo, para guardar la vista del archivo actual: >

source: When editing a specific file, you might set options specifically for that file.
es_es: Al editar un archivo en particular, puede que defina opciones específicas para ese archivo.

source: Typing these commands each time is boring.
es_es: Teclear estas órdenes es aburrido.

source: Using a session or view for editing a file doesn't work when sharing the file between several people.
es_es: Usar una sesión o vista para editar un archivo no funciona cuando comparte el archivo con varias personas.

source: The solution for this situation is adding a modeline to the file.
es_es: La solución para esta situación es añadir un «modeline» al archivo.

source: This is a line of text that tells Vim the values of options, to be used in this file only.
es_es: Éste es una línea de texto que le dice a Vim los valores de las opciones para su uso con este archivo en particular.

source: A typical example is a C program where you make indents by a multiple of 4 spaces.
es_es: Un ejemplo típico es un programa en C en el que introduce los tabulados como múltiplos de 4.

source: This requires setting the 'shiftwidth' option to 4.
es_es: Esto requiere que configure la opción 'shiftwidth' a 4.

source: This modeline will do that:
es_es: Este «modeline» hará esta función:

source: Put this line as one of the first or last five lines in the file.
es_es: Ponga esta línea como uno de las primeras o cinco últimas líneas en el archivo.

source: When editing the file, you will notice that 'shiftwidth' will have been set to four.
es_es: Cuando edite el archivo, notará que 'shiftwidth' se ha definido con valor de cuatro.

source: When editing another file, it's set back to the default value of eight.
es_es: Cuando edite otro archivo, esta opción será devuelta a su valor predeterminado de ocho.

source: For some files the modeline fits well in the header, thus it can be put at the top of the file.
es_es: Para algunas líneas, el «modeline» encaja en la cabecera, y por ello puede ponerlo al inicio del archivo.

source: For text files and other files where the modeline gets in the way of the normal contents, put it at the end of the file.
es_es: Para los archivos de texto y otros archivos en los que el «modeline» se interpone en el camino de los contenidos normales, póngala al final del archivo.

source: The 'modelines' option specifies how many lines at the start and end of the file are inspected for containing a modeline.
es_es: La opción «modelines» especifica cuantas líneas son inspeccionadas al inicio y final del archivo en busca de un «modeline».

source: To inspect ten lines: >
es_es: Para inspeccionar diez líneas: >

source: The 'modeline' option can be used to switch this off.
es_es: Puede usar la opción 'modeline' para desactivar ésto.

source: Do this when you are working as root on Unix or Administrator on MS-Windows, or when you don't trust the files you are editing: >
es_es: Haga ésto cuando trabaje como «root» en Unix, o administrador en MS-Windows; o cuando no confía en los archivos que está editando: >

source: any-text vim:set {option}={value} ...
es_es: any-text vim:set {opción}={valor} ...

source: The "any-text" indicates that you can put any text before and after the part that Vim will use.
es_es: «any-text» indica que puede introducir texto antes y después de la parte que Vim usará.

source: This allows making it look like a comment, like what was done above with /* and */.
es_es: Esto permite que presente el aspecto de un comentario, de la manera en que se hizo antes con /* y */.

source: The " vim:" part is what makes Vim recognize this line.
es_es: La parte de «vim:» es lo que hace que Vim reconozca esta línea.

source: There must be white space before "vim", or "vim" must be at the start of the line.
es_es: Debe haber un espacio en blanco antes de «vim», o «vim» ha de estar al inicio de la línea.

source: Thus using something like "gvim:" will not work.
es_es: Por ello, usar algo como «gvim» no funcionaría.

source: The part between the colons is a ":set" command.
es_es: La parte entre los dos puntos es una orden «:set».

source: It works the same way as typing the ":set" command, except that you need to insert a backslash before a colon (otherwise it would be seen as the end of the modeline).
es_es: Funciona de la misma manera que teclear la orden «:set», con la excepción de que tiene que introducir una barra inversa antes de un colon (en caso contrario, se vería como el final de un «modeline»).

source: There is an extra backslash before the first colon, so that it's included in the ":set" command.
es_es: Hay una barra inversa extra antes del primer colon, y por ello se incluye en la orden «:set».

source: The text after the second colon is ignored, thus a remark can be placed there.
es_es: Se ignora el texto antes del segundo colon, y por ello puede introducir aquí un comentario.

source: *usr_29.txt* For Vim version 7.3.
es_es: *usr_29.esx* Para Vim versión 7.3.

source: Last change: 2008 Jun 28
es_es: Último cambio: 8/6/2008

source: The creator of Vim is a computer programmer.
es_es: El creador de Vim es un programador informático.

source: It's no surprise that Vim contains many features to aid in writing programs.
es_es: Por ello, no sorprende que Vim integre tantas características que facilitan la edición de programas.

source: Jump around to find where identifiers are defined and used.
es_es: Salte de un punto a otro para ver dónde se definen y usan los identificadores.

source: Preview declarations in a separate window.
es_es: Previsualize declaraciones en una ventana distinta.

source: There is more in the next chapter.
es_es: Hay aún más en el siguiente capítulo.

source: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Now to go back.
es_es: :tags # TO tag FROM line in file/text ~ 1 1 write_line 8 write_block.c ~ 2 1 write_char 7 write_line.c ~ > ~ > Vuelva atrás ahora.

source: The CTRL-T command goes to the preceding tag.
es_es: La orden «CTRL-T» se desplaza a la etiqueta precedente.

source: In the example above you get back to the "write_line" function, in the call to "write_char".
es_es: En el ejemplo anterior, vuelve a la función «write_line» al invocar «write_char».

source: This command takes a count argument that indicates how many tags to jump back.
es_es: Esta orden toma un argumento numérico que indica el número de etiquetas que se desplazará hacia atrás.

source: You have gone forward, and now back.
es_es: Ahora que ha ido hacia delante, vuelva atrás.

source: Let's go forward again.
es_es: Vayamos otra vez hacia delante.

source: The following command goes to the tag on top of the list: >
es_es: La siguiente orden se desplaza a la etiqueta al principio de la lista: >

source: You can prefix it with a count and jump forward that many tags.
es_es: Puede precederlo de un número para saltar hacia delante ese número d etiquetas.

source: For example: ":3tag".
es_es: Por ejemplo: «:3tag».

source: CTRL-T also can be preceded with a count.
es_es: También puede preceder «CTRL-T» con un número.

source: These commands thus allow you to go down a call tree with CTRL-] and back up again with CTRL-T.
es_es: Por ello, estas órdenes permiten desplazarse hacia delante con «CTRL-]», y hacia atrás con «CTRL-T».

source: Use ":tags" to find out where you are.
es_es: Use «:tags» conocer dónde se encuentra.

source: The ":tag" command replaces the file in the current window with the one containing the new function.
es_es: La orden «:tag» reemplaza el fichero en la ventana actual con el que contiene la nueva función.

source: But suppose you want to see not only the old function but also the new one?
es_es: Pero suponga que desea ver no sólo la función antigua, y no sólo la nueva.

source: You can split the window using the ":split" command followed by the ":tag" command.
es_es: Para ello, puede dividir la ventana usando la orden «:split», seguida de la orden «:tag».

source: Vim has a shorthand command that does both: > :stag tagname
es_es: Vim tiene una orden corta que realiza ambas funciones: > :stag tagname

source: When you have files in many directories, you can create a tags file in each of them.
es_es: Cuando tiene varios ficheros en muchos directorios, puede crear un fichero de etiquetas en cada uno de ellos.

source: Vim will then only be able to jump to tags within that directory.
es_es: Vim sólo podrá saltar a etiquetas dentro de ese directorio.

source: To find more tags files, set the 'tags' option to include all the relevant tags files.
es_es: Para encontrar más ficheros de etiquetas, defina la opción 'tags' para incluir todos los ficheros de etiquetas relevantes.

source: This finds a tags file in the same directory as the current file, one directory level higher and in all subdirectories.
es_es: Esto encuentra un fichero de etiquetas en el mismo directorio que el fichero actual, un nivel de directorios superiores y en todos los subdirectorios.

source: This is quite a number of tags files, but it may still not be enough.
es_es: Este es un alto número de ficheros de etiquetas, pero puede que no lo suficiente.

source: For example, when editing a file in "~/proj/src", you will not find the tags file "~/proj/sub/tags".
es_es: Por ejemplo, al editar un fichero en «~/proj/src», no encontraría el fichero de etiquetas «~/proj/sub/tags».

source: For this situation Vim offers to search a whole directory tree for tags files.
es_es: Por ello, Vim ofrece buscar ficheros de etiquetas en todo el árbol de directorios.

source: The nice thing about this is that Exuberant ctags recognizes various file types.
es_es: Lo mejor de esto es que Exuberant ctags reconoce varios tipos de fichero.

source: Thus this doesn't work just for C and C++ programs, also for Eiffel and even Vim scripts.
es_es: Por ello, no sólo funciona con programas de C y C++, sino también para Eiffel e incluso scripts de Vim.

source: See the ctags documentation to tune this.
es_es: Consulte la documentación de ctags para información de configuración.

source: Now you only need to tell Vim where your big tags file is: >
es_es: Ahora sólo tiene que decir a Vim dónde está su fichero grande de etiquetas: >

source: When a function is defined multiple times (or a method in several classes), the ":tag" command will jump to the first one.
es_es: Cuando una función se define varias veces (o un mismo método en varias clases), la orden «:tag» saltaría a la primera aparición.

source: If there is a match in the current file, that one is used first.
es_es: De haber una coincidencia en el fichero actual, se usará éste en primer lugar.

source: You can now jump to other matches for the same tag with: >
es_es: Ahora puede saltar a otras coincidencias de la misma etiqueta con: >

source: Repeat this to find further matches.
es_es: Repita para encontrar más coincidencias.

source: If there are many, you can select which one to jump to: >
es_es: De haber varias, puede seleccionar a cuál saltar: >

source: You can now enter the number (in the first column) of the match that you would like to jump to.
es_es: Ahora puede introducir el número (en la primera columna) de la coincidencia a la que desea saltar.

source: The information in the other columns give you a good idea of where the match is defined.
es_es: La información en las otras columnas le dan un buena idea de dónde se define la coincidencia.

source: Command line completion is a good way to avoid typing a long tag name.
es_es: El autocompletado de línea de órdenes es una buena manera de evitar escribir un nombre de etiqueta largo.

source: Just type the first bit and press <Tab>: >
es_es: Simplemente escriba la primera parte y pulse <Tab>: >

source: Now use command line completion: press <Tab>.
es_es: Use ahora el autocompletado de línea de órdenes pulsando <Tab>.

source: Vim will find all tags that contain "block" and use the first match.
es_es: Vim encontrará todas las etiquetas que contienen «block», y usará la primera coincidencia.

source: The "/" before a tag name tells Vim that what follows is not a literal tag name, but a pattern.
es_es: La «/» antes del nombre de una etiqueta le dice a Vim que lo hay a continuación no es un nombre de etiqueta, sino un patrón.

source: You can use all the items for search patterns here.
es_es: Puede usar todos los elementos de patrones de búsqueda.

source: For example, suppose you want to select a tag that starts with "write_": >
es_es: Por ejemplo, supongo que desea seleccionar una etiqueta que empieza con «write»: >

source: The "^" specifies that the tag starts with "write_".
es_es: La «^» especifica que la etiqueta empieza con «write_».

source: Otherwise it would also be found halfway a tag name.
es_es: En caso contrario, se detectaría también de estar en medio de un nombre de etiqueta.

source: Similarly "$" at the end makes sure the pattern matches until the end of a tag.
es_es: De forma similar, el signo «$» al final asegura que el patrón sólo coincida con el final de una etiqueta.

source: Since CTRL-] takes you to the definition of the identifier under the cursor, you can use a list of identifier names as a table of contents.
es_es: Ya que «CTRL-]» le lleva a la definición del identificador bajo el cursor, puede usar un alista de nombres identificadores como una tabla de contenidos.

source: Here is an example.
es_es: Aquí tiene un ejemplo.

source: First create a list of identifiers (this requires Exuberant ctags): >
es_es: Primero cree una lista de identificadores (require Exuberant ctags): >

source: The window contains a list of all the functions.
es_es: Esta ventana contiene todas una lista de todas las funciones.

source: There is some more stuff, but you can ignore that.
es_es: También hay más elementos, pero los puede ignorar.

source: Do ":setlocal ts=99" to clean it up a bit.
es_es: Ejecute «setlocal ts=99» para organizarlo un poco.

source: In this window, define a mapping: >
es_es: Defina una macro en esta ventana: >

source: The 'tagbsearch' option tells if the tags file is sorted or not.
es_es: La opción 'tagbsearch' indica si el archivo de etiquetas está ordenado o no.

source: The default is to assume a sorted tags file, which makes a tags search a lot faster, but doesn't work if the tags file isn't sorted.
es_es: El valor predeterminado es suponer un archivo de etiquetas ordenado, que agiliza la búsqueda de etiquetas, pero no funciona si el archivo de etiquetas no está ordenado.

source: When you use the SNiFF+ program, you can use the Vim interface to it |sniff|.
es_es: Cuando usa el programa SNiFF+, puede usar la interfaz de Vim |sniff|.

source: SNiFF+ is a commercial program.
es_es: SNiFF+ es un programa comercial.

source: Cscope is a free program.
es_es: Cscope es un programa libre.

source: It does not only find places where an identifier is declared, but also where it is used.
es_es: No sólo encuentra los lugares dónde se declara un identificador. sino también dónde se usa.

source: See |cscope|.
es_es: Consulte |cscope|.

source: When you edit code that contains a function call, you need to use the correct arguments.
es_es: Cuando edita código que contiene una llamada a una función, necesitará los argumentos correctos.

source: To know what values to pass you can look at how the function is defined.
es_es: Para conocer los valores que puede introducir, puede ver cómo se define la función.

source: The tags mechanism works very well for this.
es_es: El mecanismo de etiquetas es adecuado para esto.

source: Preferably the definition is displayed in another window.
es_es: Preferentemente, la definición se muestra en otra ventana.

source: For this the preview window can be used.
es_es: Puede usar la ventana de previsualización para esto.

source: To open a preview window to display the function "write_char": >
es_es: Use lo siguiente para abrir una ventana de previsualización que muestre la función «write_char»: >

source: Vim will open a window, and jumps to the tag "write_char".
es_es: Vim abrirá una ventana, y saltará a la etiqueta «write_char».

source: Then it takes you back to the original position.
es_es: A continuación, vuelve a la posición original.

source: Thus you can continue typing without the need to use a CTRL-W command.
es_es: Así, puede seguir escribiendo sin necesidad de usar la orden «CTRL-W».

source: If the name of a function appears in the text, you can get its definition in the preview window with: >
es_es: Si el nombre de una función aparece en el texto, puede obtener su definición en la ventana de previsualización con lo siguiente: >

source: There is a script that automatically displays the text where the word under the cursor was defined.
es_es: Hay un script que muestra el texto automáticamente dónde se definió la palabra bajo el cursor.

source: See |CursorHold-example|.
es_es: Consulte |CursorHold-example|.

source: To edit a specific file in the preview window, use ":pedit".
es_es: Para editar un fichero específico en la ventana de previsualización, use «_pedit».

source: This can be useful to edit a header file, for example: >
es_es: Esto puede ser útil para editar la cabecera de un archivo, por ejemplo: >

source: Finally, ":psearch" can be used to find a word in the current file and any included files and display the match in the preview window.
es_es: Por último, «:psearch» se puede utilizar para buscar una palabra en el archivo actual y cualquier archivo incluido («include») y mostrar la coincidencia en la ventana de previsualización.
